Revit 2027 API
BuiltInFailures.SketchFailures.NoLoopsPath3d Property
 Sketch is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoLoopsPath3d { get; }
Public Shared ReadOnly Property NoLoopsPath3d As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoLoopsPath3d {
	FailureDefinitionId^ get ();
}
static member NoLoopsPath3d : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace